Tekla Open API Reference for Tekla Structures 2025
Line Constructor
Overload List
Name | Description
Line()
 Instantiates a line with an undefined direction.
Line(LineSegment)
 Instantiates a line defined by the given line segment.
Line(Point, Point)
 Instantiates a line defined by the given points.
Line(Point, Vector)
 Instantiates a line defined by the given point and direction vector.
Top
See Also
Reference
Line Class
Tekla.Structures.Geometry3d Namespace